### Pandas
- Series
- DataFrame
- Panel

In [1]:
import pandas as pd
pd.__version__

'0.24.2'

### series
- from list ,tuple,dictionary
- from numpy array

In [2]:
import numpy as np
np.array([1,2,3])

array([1, 2, 3])

In [4]:
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

In [13]:
s1=pd.Series([1,2,3],index=['I','II','III'])
s1

I      1
II     2
III    3
dtype: int64

In [14]:
print(s1[0])
print(s1[0],s1['I'])

1
1 1

In [15]:
print(s1[0:2])

I     1
II    2
dtype: int64

In [18]:
s1['I':'III']

I      1
II     2
III    3
dtype: int64

In [27]:
s1.index=['i1','i2','i3']
s1

i1    1
i2    2
i3    3
dtype: int64

In [24]:
marks={'maths':67,'science':78,'english':56}
marks

{'maths': 67, 'science': 78, 'english': 56}

In [25]:
pd.Series(marks)

maths      67
science    78
english    56
dtype: int64

In [28]:
pd.date_range('2019-11-23','2019-11-30')

DatetimeIndex(['2019-11-23', '2019-11-24', '2019-11-25', '2019-11-26',
               '2019-11-27', '2019-11-28', '2019-11-29', '2019-11-30'],
              dtype='datetime64[ns]', freq='D')

In [29]:
pd.date_range('2019-11-23',periods=5)

DatetimeIndex(['2019-11-23', '2019-11-24', '2019-11-25', '2019-11-26',
               '2019-11-27'],
              dtype='datetime64[ns]', freq='D')

In [36]:
temp=pd.Series([32,29,30,31],pd.date_range('2019-11-23',periods=4))
temp

2019-11-23    32
2019-11-24    29
2019-11-25    30
2019-11-26    31
Freq: D, dtype: int64

In [37]:
temp.index

DatetimeIndex(['2019-11-23', '2019-11-24', '2019-11-25', '2019-11-26'], dtype='datetime64[ns]', freq='D')

In [39]:
s1.index

Index(['i1', 'i2', 'i3'], dtype='object')

In [40]:
pd.Series(np.arange(10))

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

### DATA FRAME
- from a dictionary
- from numpy 2d array

In [403]:
studentmarks={"Student Names":['Ram','Asha','Giri'],"Maths":[23,45,67],"Science":[57,78,90],"English":[35,66,47]}
studentmarks

{'Student Names': ['Ram', 'Asha', 'Giri'],
 'Maths': [23, 45, 67],
 'Science': [57, 78, 90],
 'English': [35, 66, 47]}

In [405]:
pd.DataFrame(studentmarks)

  Student Names  Maths  Science  English
0           Ram     23       57       35
1          Asha     45       78       66
2          Giri     67       90       47

In [406]:
a2=np.array([['Ram',23,57,35],['Asha',45,78,66]])
pd.DataFrame(a2,columns=['Name','Maths','Science','English'],index=['std1','std2'])

      Name Maths Science English
std1   Ram    23      57      35
std2  Asha    45      78      66

In [407]:
pd.DataFrame(a2,columns=['Name','Maths','Science','English'],index=['std1','std2'])

      Name Maths Science English
std1   Ram    23      57      35
std2  Asha    45      78      66

### pd.read_csv()

In [408]:
pd.read_csv('marks.csv')

  Student Name  Maths  Science  English
0        'Ram'     23       57       35
1       'Asha'     45       78       66
2       'Roja'     56       55       45
3       'Suma'     45       78       90
4      'Rohan'     89       34       56
5      'siddu'     78       45       65
6    'kavitha'     12       34       56
7       'Giri'     45       34       67
8    'Alekhya'     45       89       67

In [409]:
pd.read_csv('marks.csv',header=None)

              0      1        2        3
0  Student Name  Maths  Science  English
1         'Ram'     23       57       35
2        'Asha'     45       78       66
3        'Roja'     56       55       45
4        'Suma'     45       78       90
5       'Rohan'     89       34       56
6       'siddu'     78       45       65
7     'kavitha'     12       34       56
8        'Giri'     45       34       67
9     'Alekhya'     45       89       67

In [410]:
pd.read_csv('marks.csv',header=1)

       'Ram'  23  57  35
0     'Asha'  45  78  66
1     'Roja'  56  55  45
2     'Suma'  45  78  90
3    'Rohan'  89  34  56
4    'siddu'  78  45  65
5  'kavitha'  12  34  56
6     'Giri'  45  34  67
7  'Alekhya'  45  89  67

In [411]:
pd.read_csv('marks.csv')

  Student Name  Maths  Science  English
0        'Ram'     23       57       35
1       'Asha'     45       78       66
2       'Roja'     56       55       45
3       'Suma'     45       78       90
4      'Rohan'     89       34       56
5      'siddu'     78       45       65
6    'kavitha'     12       34       56
7       'Giri'     45       34       67
8    'Alekhya'     45       89       67

In [412]:
help(pd.read_csv)

Help on function read_csv in module pandas.io.parsers:

read_csv(filepath_or_buffer, sep=',', delimiter=None, header='infer', names=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, iterator=False, chunksize=None, compression='infer', thousands=None, decimal=b'.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, dialect=None, tupleize_cols=None, error_bad_lines=True, warn_bad_lines=True, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None)
    Read a comma-separated values (csv) file into DataFrame.

    Also supports optionally iterating or breaking of the file
    into chunks.

    Additional help can be found in the online docs for
    `IO Tools <http://pandas.pydata.org/pandas-docs/stable/io.html>`_.

    Parameters
    ----------
    filepath_or_buffer : str, path object, or file-like object
        Any valid string path is acceptable. The string could be a URL. Valid
        URL schemes include http, ftp, s3, and file. For file URLs, a host is
        expected. A local file could be: file://localhost/path/to/table.csv.

        If you want to pass in a path object, pandas accepts either
        ``pathlib.Path`` or ``py._path.local.LocalPath``.

        By file-like object, we refer to objects with a ``read()`` method, such as
        a file handler (e.g. via builtin ``open`` function) or ``StringIO``.
    sep : str, default ','
        Delimiter to use. If sep is None, the C engine cannot automatically detect
        the separator, but the Python parsing engine can, meaning the latter will
        be used and automatically detect the separator by Python's builtin sniffer
        tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
        different from ``'\s+'`` will be interpreted as regular expressions and
        will also force the use of the Python parsing engine. Note that regex
        delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``.
    delimiter : str, default ``None``
        Alias for sep.
    header : int, list of int, default 'infer'
        Row number(s) to use as the column names, and the start of the
        data.  Default behavior is to infer the column names: if no names
        are passed the behavior is identical to ``header=0`` and column
        names are inferred from the first line of the file, if column
        names are passed explicitly then the behavior is identical to
        ``header=None``. Explicitly pass ``header=0`` to be able to
        replace existing names. The header can be a list of integers that
        specify row locations for a multi-index on the columns
        e.g. [0,1,3]. Intervening rows that are not specified will be
        skipped (e.g. 2 in this example is skipped). Note that this
        parameter ignores commented lines and empty lines if
        ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
        data rather than the first line of the file.
    names : array-like, optional
        List of column names to use. If file contains no header row, then you
        should explicitly pass ``header=None``. Duplicates in this list will cause
        a ``UserWarning`` to be issued.
    index_col : int, sequence or bool, optional
        Column to use as the row labels of the DataFrame. If a sequence is given, a
        MultiIndex is used. If you have a malformed file with delimiters at the end
        of each line, you might consider ``index_col=False`` to force pandas to
        not use the first column as the index (row names).
    usecols : list-like or callable, optional
        Return a subset of the columns. If list-like, all elements must either
        be positional (i.e. integer indices into the document columns) or strings
        that correspond to column names provided either by the user in `names` or
        inferred from the document header row(s). For example, a valid list-like
        `usecols` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
        Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
        To instantiate a DataFrame from ``data`` with element order preserved use
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
        in ``['foo', 'bar']`` order or
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
        for ``['bar', 'foo']`` order.

        If callable, the callable function will be evaluated against the column
        names, returning names where the callable function evaluates to True. An
        example of a valid callable argument would be ``lambda x: x.upper() in
        ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
        parsing time and lower memory usage.
    squeeze : bool, default False
        If the parsed data only contains one column then return a Series.
    prefix : str, optional
        Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...
    mangle_dupe_cols : bool, default True
        Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
        'X'...'X'. Passing in False will cause data to be overwritten if there
        are duplicate names in the columns.
    dtype : Type name or dict of column -> type, optional
        Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32,
        'c': 'Int64'}
        Use `str` or `object` together with suitable `na_values` settings
        to preserve and not interpret dtype.
        If converters are specified, they will be applied INSTEAD
        of dtype conversion.
    engine : {'c', 'python'}, optional
        Parser engine to use. The C engine is faster while the python engine is
        currently more feature-complete.
    converters : dict, optional
        Dict of functions for converting values in certain columns. Keys can either
        be integers or column labels.
    true_values : list, optional
        Values to consider as True.
    false_values : list, optional
        Values to consider as False.
    skipinitialspace : bool, default False
        Skip spaces after delimiter.
    skiprows : list-like, int or callable, optional
        Line numbers to skip (0-indexed) or number of lines to skip (int)
        at the start of the file.

        If callable, the callable function will be evaluated against the row
        indices, returning True if the row should be skipped and False otherwise.
        An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
    skipfooter : int, default 0
        Number of lines at bottom of file to skip (Unsupported with engine='c').
    nrows : int, optional
        Number of rows of file to read. Useful for reading pieces of large files.
    na_values : scalar, str, list-like, or dict, optional
        Additional strings to recognize as NA/NaN. If dict passed, specific
        per-column NA values.  By default the following values are interpreted as
        NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
        '1.#IND', '1.#QNAN', 'N/A', 'NA', 'NULL', 'NaN', 'n/a', 'nan',
        'null'.
    keep_default_na : bool, default True
        Whether or not to include the default NaN values when parsing the data.
        Depending on whether `na_values` is passed in, the behavior is as follows:

        * If `keep_default_na` is True, and `na_values` are specified, `na_values`
          is appended to the default NaN values used for parsing.
        * If `keep_default_na` is True, and `na_values` are not specified, only
          the default NaN values are used for parsing.
        * If `keep_default_na` is False, and `na_values` are specified, only
          the NaN values specified `na_values` are used for parsing.
        * If `keep_default_na` is False, and `na_values` are not specified, no
          strings will be parsed as NaN.

        Note that if `na_filter` is passed in as False, the `keep_default_na` and
        `na_values` parameters will be ignored.
    na_filter : bool, default True
        Detect missing value markers (empty strings and the value of na_values). In
        data without any NAs, passing na_filter=False can improve the performance
        of reading a large file.
    verbose : bool, default False
        Indicate number of NA values placed in non-numeric columns.
    skip_blank_lines : bool, default True
        If True, skip over blank lines rather than interpreting as NaN values.
    parse_dates : bool or list of int or names or list of lists or dict, default False
        The behavior is as follows:

        * boolean. If True -> try parsing the index.
        * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
          each as a separate date column.
        * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
          a single date column.
        * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
          result 'foo'

        If a column or index cannot be represented as an array of datetimes,
        say because of an unparseable value or a mixture of timezones, the column
        or index will be returned unaltered as an object data type. For
        non-standard datetime parsing, use ``pd.to_datetime`` after
        ``pd.read_csv``. To parse an index or column with a mixture of timezones,
        specify ``date_parser`` to be a partially-applied
        :func:`pandas.to_datetime` with ``utc=True``. See
        :ref:`io.csv.mixed_timezones` for more.

        Note: A fast-path exists for iso8601-formatted dates.
    infer_datetime_format : bool, default False
        If True and `parse_dates` is enabled, pandas will attempt to infer the
        format of the datetime strings in the columns, and if it can be inferred,
        switch to a faster method of parsing them. In some cases this can increase
        the parsing speed by 5-10x.
    keep_date_col : bool, default False
        If True and `parse_dates` specifies combining multiple columns then
        keep the original columns.
    date_parser : function, optional
        Function to use for converting a sequence of string columns to an array of
        datetime instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. Pandas will try to call `date_parser` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by `parse_dates` into a single array
        and pass that; and 3) call `date_parser` once for each row using one or
        more strings (corresponding to the columns defined by `parse_dates`) as
        arguments.
    dayfirst : bool, default False
        DD/MM format dates, international and European format.
    iterator : bool, default False
        Return TextFileReader object for iteration or getting chunks with
        ``get_chunk()``.
    chunksize : int, optional
        Return TextFileReader object for iteration.
        See the `IO Tools docs
        <http://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
        for more information on ``iterator`` and ``chunksize``.
    compression : {'infer', 'gzip', 'bz2', 'zip', 'xz', None}, default 'infer'
        For on-the-fly decompression of on-disk data. If 'infer' and
        `filepath_or_buffer` is path-like, then detect compression from the
        following extensions: '.gz', '.bz2', '.zip', or '.xz' (otherwise no
        decompression). If using 'zip', the ZIP file must contain only one data
        file to be read in. Set to None for no decompression.

        .. versionadded:: 0.18.1 support for 'zip' and 'xz' compression.

    thousands : str, optional
        Thousands separator.
    decimal : str, default '.'
        Character to recognize as decimal point (e.g. use ',' for European data).
    lineterminator : str (length 1), optional
        Character to break file into lines. Only valid with C parser.
    quotechar : str (length 1), optional
        The character used to denote the start and end of a quoted item. Quoted
        items can include the delimiter and it will be ignored.
    quoting : int or csv.QUOTE_* instance, default 0
        Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
        QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
    doublequote : bool, default ``True``
       When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
       whether or not to interpret two consecutive quotechar elements INSIDE a
       field as a single ``quotechar`` element.
    escapechar : str (length 1), optional
        One-character string used to escape other characters.
    comment : str, optional
        Indicates remainder of line should not be parsed. If found at the beginning
        of a line, the line will be ignored altogether. This parameter must be a
        single character. Like empty lines (as long as ``skip_blank_lines=True``),
        fully commented lines are ignored by the parameter `header` but not by
        `skiprows`. For example, if ``comment='#'``, parsing
        ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
        treated as the header.
    encoding : str, optional
        Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
        standard encodings
        <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .
    dialect : str or csv.Dialect, optional
        If provided, this parameter will override values (default or not) for the
        following parameters: `delimiter`, `doublequote`, `escapechar`,
        `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
        override values, a ParserWarning will be issued. See csv.Dialect
        documentation for more details.
    tupleize_cols : bool, default False
        Leave a list of tuples on columns as is (default is to convert to
        a MultiIndex on the columns).

        .. deprecated:: 0.21.0
           This argument will be removed and will always convert to MultiIndex

    error_bad_lines : bool, default True
        Lines with too many fields (e.g. a csv line with too many commas) will by
        default cause an exception to be raised, and no DataFrame will be returned.
        If False, then these "bad lines" will dropped from the DataFrame that is
        returned.
    warn_bad_lines : bool, default True
        If error_bad_lines is False, and warn_bad_lines is True, a warning for each
        "bad line" will be output.
    delim_whitespace : bool, default False
        Specifies whether or not whitespace (e.g. ``' '`` or ``'    '``) will be
        used as the sep. Equivalent to setting ``sep='\s+'``. If this option
        is set to True, nothing should be passed in for the ``delimiter``
        parameter.

        .. versionadded:: 0.18.1 support for the Python parser.

    low_memory : bool, default True
        Internally process the file in chunks, resulting in lower memory use
        while parsing, but possibly mixed type inference.  To ensure no mixed
        types either set False, or specify the type with the `dtype` parameter.
        Note that the entire file is read into a single DataFrame regardless,
        use the `chunksize` or `iterator` parameter to return the data in chunks.
        (Only valid with C parser).
    memory_map : bool, default False
        If a filepath is provided for `filepath_or_buffer`, map the file object
        directly onto memory and access the data directly from there. Using this
        option can improve performance because there is no longer any I/O overhead.
    float_precision : str, optional
        Specifies which converter the C engine should use for floating-point
        values. The options are `None` for the ordinary converter,
        `high` for the high-precision converter, and `round_trip` for the
        round-trip converter.

    Returns
    -------
    DataFrame or TextParser
        A comma-separated values (csv) file is returned as two-dimensional
        data structure with labeled axes.

    See Also
    --------
    to_csv : Write DataFrame to a comma-separated values (csv) file.
    read_csv : Read a comma-separated values (csv) file into DataFrame.
    read_fwf : Read a table of fixed-width formatted lines into DataFrame.

    Examples
    --------
    >>> pd.read_csv('data.csv')  # doctest: +SKIP

In [413]:
df=pd.read_csv('marks.csv')

In [414]:
df

  Student Name  Maths  Science  English
0        'Ram'     23       57       35
1       'Asha'     45       78       66
2       'Roja'     56       55       45
3       'Suma'     45       78       90
4      'Rohan'     89       34       56
5      'siddu'     78       45       65
6    'kavitha'     12       34       56
7       'Giri'     45       34       67
8    'Alekhya'     45       89       67

In [415]:
df['Student Name']

0        'Ram'
1       'Asha'
2       'Roja'
3       'Suma'
4      'Rohan'
5      'siddu'
6    'kavitha'
7       'Giri'
8    'Alekhya'
Name: Student Name, dtype: object

In [416]:
df['Student Name']

0        'Ram'
1       'Asha'
2       'Roja'
3       'Suma'
4      'Rohan'
5      'siddu'
6    'kavitha'
7       'Giri'
8    'Alekhya'
Name: Student Name, dtype: object

In [417]:
df[['Student Name','Maths']]

  Student Name  Maths
0        'Ram'     23
1       'Asha'     45
2       'Roja'     56
3       'Suma'     45
4      'Rohan'     89
5      'siddu'     78
6    'kavitha'     12
7       'Giri'     45
8    'Alekhya'     45

In [418]:
df.values

array([["'Ram'", 23, 57, 35],
       ["'Asha'", 45, 78, 66],
       ["'Roja'", 56, 55, 45],
       ["'Suma'", 45, 78, 90],
       ["'Rohan'", 89, 34, 56],
       ["'siddu'", 78, 45, 65],
       ["'kavitha'", 12, 34, 56],
       ["'Giri'", 45, 34, 67],
       ["'Alekhya'", 45, 89, 67]], dtype=object)

In [419]:
df.columns#to get the column names

Index(['Student Name', 'Maths', 'Science', 'English'], dtype='object')

In [420]:
df.dtypes#data type of each number

Student Name    object
Maths            int64
Science          int64
English          int64
dtype: object

In [422]:
df.index#row indices

RangeIndex(start=0, stop=9, step=1)

In [423]:
df.shape#tuple of number of rows and columns

(9, 4)

In [424]:
print(df.shape[0])# tuple of no of rows and columns
print(df.shape[1])

9
4

In [389]:
print(df)

  Student Name  Maths  Science  English
0        'Ram'     23       57       35
1       'Asha'     45       78       66
2       'Roja'     56       55       45
3       'Suma'     45       78       90
4      'Rohan'     89       34       56
5      'siddu'     78       45       65
6    'kavitha'     12       34       56
7       'Giri'     45       34       67
8    'Alekhya'     45       89       67

### Indexing
- Position based Indexing(iloc)
- Label based Indexing(loc)

### df.iloc

In [425]:
df.iloc[2,0:2]

Student Name    'Roja'
Maths               56
Name: 2, dtype: object

In [426]:
df.iloc[4,0:2]

Student Name    'Rohan'
Maths                89
Name: 4, dtype: object

In [427]:
df.iloc[2,3]

45

In [428]:
df.iloc[2,:]#df.iloc

Student Name    'Roja'
Maths               56
Science             55
English             45
Name: 2, dtype: object

In [429]:
df.iloc[:,1]

0    23
1    45
2    56
3    45
4    89
5    78
6    12
7    45
8    45
Name: Maths, dtype: int64

In [430]:
df.iloc[[1,3,6],[2,0,1]]

   Science Student Name  Maths
1       78       'Asha'     45
3       78       'Suma'     45
6       34    'kavitha'     12

In [431]:
df.loc[0,'Student Name']

"'Ram'"

In [432]:
df.loc[2:4,'Student Name']

2     'Roja'
3     'Suma'
4    'Rohan'
Name: Student Name, dtype: object

In [433]:
df.loc[2:4,'Student Name':'Science']

  Student Name  Maths  Science
2       'Roja'     56       55
3       'Suma'     45       78
4      'Rohan'     89       34

In [434]:
df.loc[2:4,['Science','Student Name']]

   Science Student Name
2       55       'Roja'
3       78       'Suma'
4       34      'Rohan'

In [435]:
df[['Student Name','Science','Maths','English']]

  Student Name  Science  Maths  English
0        'Ram'       57     23       35
1       'Asha'       78     45       66
2       'Roja'       55     56       45
3       'Suma'       78     45       90
4      'Rohan'       34     89       56
5      'siddu'       45     78       65
6    'kavitha'       34     12       56
7       'Giri'       34     45       67
8    'Alekhya'       89     45       67

In [436]:
df.set_index('Student Name')

              Maths  Science  English
Student Name
'Ram'            23       57       35
'Asha'           45       78       66
'Roja'           56       55       45
'Suma'           45       78       90
'Rohan'          89       34       56
'siddu'          78       45       65
'kavitha'        12       34       56
'Giri'           45       34       67
'Alekhya'        45       89       67

In [437]:
df1=df.set_index('Student Name')
df1

              Maths  Science  English
Student Name
'Ram'            23       57       35
'Asha'           45       78       66
'Roja'           56       55       45
'Suma'           45       78       90
'Rohan'          89       34       56
'siddu'          78       45       65
'kavitha'        12       34       56
'Giri'           45       34       67
'Alekhya'        45       89       67

In [438]:
df1.loc["'Ram'",'Maths']

23

In [439]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
Student Name    9 non-null object
Maths           9 non-null int64
Science         9 non-null int64
English         9 non-null int64
dtypes: int64(3), object(1)
memory usage: 368.0+ bytes

In [448]:
df['Total']=df['English']+df['Maths']+df['Science']
df

  Student Name  Maths  Science  English  Total
1       'Asha'     45       78       66    189
2       'Roja'     56       55       45    156
3       'Suma'     45       78       90    213
4      'Rohan'     89       34       56    179
5      'siddu'     78       45       65    188
6    'kavitha'     12       34       56    102
7       'Giri'     45       34       67    146
8    'Alekhya'     45       89       67    201

In [449]:
df.iloc[:,1:4].sum(axis=1)

1    189
2    156
3    213
4    179
5    188
6    102
7    146
8    201
dtype: int64

In [451]:
df.describe()

           Maths    Science    English       Total
count   8.000000   8.000000   8.000000    8.000000
mean   51.875000  55.875000  64.000000  171.750000
std    23.473009  22.774908  13.027444   35.752123
min    12.000000  34.000000  45.000000  102.000000
25%    45.000000  34.000000  56.000000  153.500000
50%    45.000000  50.000000  65.500000  183.500000
75%    61.500000  78.000000  67.000000  192.000000
max    89.000000  89.000000  90.000000  213.000000

In [475]:
student_df=pd.read_csv('student.csv',names=['Student Name','College','Course'])
student_df

  Student Name  College            Course
0         Name  College            Course
1        'Ram'     iiit  Machine learning
2       'Asha'     svce            Python
3       'Roja'     srkr      Data Science
4       'Suma'     srkr      Data Science
5      'Rohan'     iiit      Data Science
6       'Guru'     iiit  Machine Learning
7      'Kumar'     svec      Data Science

### check the
- head
- tail
- sample
- shape
- columns
- dttypes
- index
- info
- describe

In [453]:
student_df.head(2)#first 2 rows

           Name  College            Course
0  Student Name  College            Course
1         'Ram'     iiit  Machine learning

In [454]:
student_df.tail(2)#last two rows

      Name College            Course
6   'Guru'    iiit  Machine Learning
7  'Kumar'    svec      Data Science

In [455]:
student_df.shape

(8, 3)

In [456]:
student_df.sample(3)#random selection

           Name  College            Course
4        'Suma'     srkr      Data Science
6        'Guru'     iiit  Machine Learning
0  Student Name  College            Course

In [457]:
student_df.columns

Index(['Name', 'College', 'Course'], dtype='object')

In [458]:
student_df.dtypes

Name       object
College    object
Course     object
dtype: object

In [461]:
student_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
Name       8 non-null object
College    8 non-null object
Course     8 non-null object
dtypes: object(3)
memory usage: 272.0+ bytes

In [462]:
student_df.describe()

           Name College        Course
count         8       8             8
unique        8       5             5
top     'Kumar'    iiit  Data Science
freq          1       3             4

In [463]:
student_df.nunique()

Name       8
College    5
Course     5
dtype: int64

In [464]:
student_df.College.value_counts()

iiit       3
srkr       2
svec       1
College    1
svce       1
Name: College, dtype: int64

### pd.merge

In [476]:
pd.merge(df,student_df,on='Student Name',how="inner")

  Student Name  Maths  Science  English  Total College        Course
0       'Asha'     45       78       66    189    svce        Python
1       'Roja'     56       55       45    156    srkr  Data Science
2       'Suma'     45       78       90    213    srkr  Data Science
3      'Rohan'     89       34       56    179    iiit  Data Science

In [478]:
pd.merge(df,student_df,on='Student Name',how='outer')

   Student Name  Maths  Science  English  Total  College            Course
0        'Asha'   45.0     78.0     66.0  189.0     svce            Python
1        'Roja'   56.0     55.0     45.0  156.0     srkr      Data Science
2        'Suma'   45.0     78.0     90.0  213.0     srkr      Data Science
3       'Rohan'   89.0     34.0     56.0  179.0     iiit      Data Science
4       'siddu'   78.0     45.0     65.0  188.0      NaN               NaN
5     'kavitha'   12.0     34.0     56.0  102.0      NaN               NaN
6        'Giri'   45.0     34.0     67.0  146.0      NaN               NaN
7     'Alekhya'   45.0     89.0     67.0  201.0      NaN               NaN
8          Name    NaN      NaN      NaN    NaN  College            Course
9         'Ram'    NaN      NaN      NaN    NaN     iiit  Machine learning
10       'Guru'    NaN      NaN      NaN    NaN     iiit  Machine Learning
11      'Kumar'    NaN      NaN      NaN    NaN     svec      Data Science

In [479]:
pd.merge(df,student_df,on='Student Name',how='left')

  Student Name  Maths  Science  English  Total College        Course
0       'Asha'     45       78       66    189    svce        Python
1       'Roja'     56       55       45    156    srkr  Data Science
2       'Suma'     45       78       90    213    srkr  Data Science
3      'Rohan'     89       34       56    179    iiit  Data Science
4      'siddu'     78       45       65    188     NaN           NaN
5    'kavitha'     12       34       56    102     NaN           NaN
6       'Giri'     45       34       67    146     NaN           NaN
7    'Alekhya'     45       89       67    201     NaN           NaN

In [480]:
pd.merge(df,student_df,on='Student Name',how='right')

  Student Name  Maths  Science  English  Total  College            Course
0       'Asha'   45.0     78.0     66.0  189.0     svce            Python
1       'Roja'   56.0     55.0     45.0  156.0     srkr      Data Science
2       'Suma'   45.0     78.0     90.0  213.0     srkr      Data Science
3      'Rohan'   89.0     34.0     56.0  179.0     iiit      Data Science
4         Name    NaN      NaN      NaN    NaN  College            Course
5        'Ram'    NaN      NaN      NaN    NaN     iiit  Machine learning
6       'Guru'    NaN      NaN      NaN    NaN     iiit  Machine Learning
7      'Kumar'    NaN      NaN      NaN    NaN     svec      Data Science

### Boolean or Fancy Indexing

In [481]:
df['Maths']>60

1    False
2    False
3    False
4     True
5     True
6    False
7    False
8    False
Name: Maths, dtype: bool

In [482]:
df[(df['Maths']>60)&(df['Maths']<80)]

  Student Name  Maths  Science  English  Total
5      'siddu'     78       45       65    188

In [483]:
student_df['Course']=='Machine Learning'

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
Name: Course, dtype: bool

In [484]:
student_df[student_df['Course']=='Machine Learning']

  Student Name College            Course
6       'Guru'    iiit  Machine Learning

In [485]:
student_df[student_df['College']=='iiit']

  Student Name College            Course
1        'Ram'    iiit  Machine learning
5      'Rohan'    iiit      Data Science
6       'Guru'    iiit  Machine Learning

### Sorting

In [486]:
df.sort_values('Maths')

  Student Name  Maths  Science  English  Total
6    'kavitha'     12       34       56    102
1       'Asha'     45       78       66    189
3       'Suma'     45       78       90    213
7       'Giri'     45       34       67    146
8    'Alekhya'     45       89       67    201
2       'Roja'     56       55       45    156
5      'siddu'     78       45       65    188
4      'Rohan'     89       34       56    179

In [487]:
df.sort_values('Maths',ascending=False)

  Student Name  Maths  Science  English  Total
4      'Rohan'     89       34       56    179
5      'siddu'     78       45       65    188
2       'Roja'     56       55       45    156
1       'Asha'     45       78       66    189
3       'Suma'     45       78       90    213
7       'Giri'     45       34       67    146
8    'Alekhya'     45       89       67    201
6    'kavitha'     12       34       56    102

In [488]:
df.sort_values('Total',ascending=False)

  Student Name  Maths  Science  English  Total
3       'Suma'     45       78       90    213
8    'Alekhya'     45       89       67    201
1       'Asha'     45       78       66    189
5      'siddu'     78       45       65    188
4      'Rohan'     89       34       56    179
2       'Roja'     56       55       45    156
7       'Giri'     45       34       67    146
6    'kavitha'     12       34       56    102

In [490]:
df.sort_values('Student Name')

  Student Name  Maths  Science  English  Total
8    'Alekhya'     45       89       67    201
1       'Asha'     45       78       66    189
7       'Giri'     45       34       67    146
4      'Rohan'     89       34       56    179
2       'Roja'     56       55       45    156
3       'Suma'     45       78       90    213
6    'kavitha'     12       34       56    102
5      'siddu'     78       45       65    188

In [491]:
df1

              Maths  Science  English
Student Name
'Ram'            23       57       35
'Asha'           45       78       66
'Roja'           56       55       45
'Suma'           45       78       90
'Rohan'          89       34       56
'siddu'          78       45       65
'kavitha'        12       34       56
'Giri'           45       34       67
'Alekhya'        45       89       67

In [492]:
df1.sort_index()

              Maths  Science  English
Student Name
'Alekhya'        45       89       67
'Asha'           45       78       66
'Giri'           45       34       67
'Ram'            23       57       35
'Rohan'          89       34       56
'Roja'           56       55       45
'Suma'           45       78       90
'kavitha'        12       34       56
'siddu'          78       45       65

### Missing Values

In [493]:
df.isnull()

   Student Name  Maths  Science  English  Total
1         False  False    False    False  False
2         False  False    False    False  False
3         False  False    False    False  False
4         False  False    False    False  False
5         False  False    False    False  False
6         False  False    False    False  False
7         False  False    False    False  False
8         False  False    False    False  False

In [494]:
df.isnull().sum()

Student Name    0
Maths           0
Science         0
English         0
Total           0
dtype: int64

In [495]:
print(df.Science.mean())

55.875

In [496]:
df1.drop("'Ram'")

              Maths  Science  English
Student Name
'Asha'           45       78       66
'Roja'           56       55       45
'Suma'           45       78       90
'Rohan'          89       34       56
'siddu'          78       45       65
'kavitha'        12       34       56
'Giri'           45       34       67
'Alekhya'        45       89       67

In [497]:
final_df=pd.merge(df,student_df,how='outer')
final_df

   Student Name  Maths  Science  English  Total  College            Course
0        'Asha'   45.0     78.0     66.0  189.0     svce            Python
1        'Roja'   56.0     55.0     45.0  156.0     srkr      Data Science
2        'Suma'   45.0     78.0     90.0  213.0     srkr      Data Science
3       'Rohan'   89.0     34.0     56.0  179.0     iiit      Data Science
4       'siddu'   78.0     45.0     65.0  188.0      NaN               NaN
5     'kavitha'   12.0     34.0     56.0  102.0      NaN               NaN
6        'Giri'   45.0     34.0     67.0  146.0      NaN               NaN
7     'Alekhya'   45.0     89.0     67.0  201.0      NaN               NaN
8          Name    NaN      NaN      NaN    NaN  College            Course
9         'Ram'    NaN      NaN      NaN    NaN     iiit  Machine learning
10       'Guru'    NaN      NaN      NaN    NaN     iiit  Machine Learning
11      'Kumar'    NaN      NaN      NaN    NaN     svec      Data Science

In [498]:
cat_cols=final_df.describe(include=object).columns
num_cols=final_df.columns[final_df.dtypes !=object]

In [356]:
print(cat_cols)
print(num_cols)

Index(['Name', 'Maths', 'Science', 'English', 'Total', 'College', 'Course'], dtype='object')
Index([], dtype='object')

### Numerical Columns

In [357]:
for col in num_cols:
    final_df[col].fillna(final_df[col].mean(),inplace=True)

In [358]:
final_df

            Name Maths Science English   Total  College            Course
0          'Ram'    23      57      35  352357     iiit  Machine learning
1         'Asha'    45      78      66  664578     svce            Python
2         'Roja'    56      55      45  455655     srkr      Data Science
3         'Suma'    45      78      90  904578     srkr      Data Science
4        'Rohan'    89      34      56  568934     iiit      Data Science
5        'siddu'    78      45      65  657845      NaN               NaN
6      'kavitha'    12      34      56  561234      NaN               NaN
7         'Giri'    45      34      67  674534      NaN               NaN
8      'Alekhya'    45      89      67  674589      NaN               NaN
9   Student Name   NaN     NaN     NaN     NaN  College            Course
10        'Guru'   NaN     NaN     NaN     NaN     iiit  Machine Learning
11       'Kumar'   NaN     NaN     NaN     NaN     svec      Data Science

In [499]:
for col in cat_cols:
    final_df[col].fillna(final_df[col].mode()[0],inplace=True)

In [500]:
final_df['College'][final_df['College'].isna()]

Series([], Name: College, dtype: object)

In [501]:
final_df['College'].mode()[0]

'iiit'

In [368]:
final_df

            Name Maths Science English   Total  College            Course
0          'Ram'    23      57      35  352357     iiit  Machine learning
1         'Asha'    45      78      66  664578     svce            Python
2         'Roja'    56      55      45  455655     srkr      Data Science
3         'Suma'    45      78      90  904578     srkr      Data Science
4        'Rohan'    89      34      56  568934     iiit      Data Science
5        'siddu'    78      45      65  657845     iiit      Data Science
6      'kavitha'    12      34      56  561234     iiit      Data Science
7         'Giri'    45      34      67  674534     iiit      Data Science
8      'Alekhya'    45      89      67  674589     iiit      Data Science
9   Student Name    45      34      56  352357  College            Course
10        'Guru'    45      34      56  352357     iiit  Machine Learning
11       'Kumar'    45      34      56  352357     svec      Data Science

###  Grouping

In [502]:
final_df.groupby('College')['Maths'].max()

College
College     NaN
iiit       89.0
srkr       56.0
svce       45.0
svec        NaN
Name: Maths, dtype: float64

In [503]:
final_df.groupby('College').sum()

         Maths  Science  English  Total
College
College    0.0      0.0      0.0    0.0
iiit     269.0    236.0    311.0  816.0
srkr     101.0    133.0    135.0  369.0
svce      45.0     78.0     66.0  189.0
svec       0.0      0.0      0.0    0.0

In [504]:
final_df.groupby('Course').Maths.max()

Course
Course               NaN
Data Science        89.0
Machine Learning     NaN
Machine learning     NaN
Python              45.0
Name: Maths, dtype: float64

In [505]:
final_df.groupby(['Course','College']).Maths.max()

Course            College
Course            College     NaN
Data Science      iiit       89.0
                  srkr       56.0
                  svec        NaN
Machine Learning  iiit        NaN
Machine learning  iiit        NaN
Python            svce       45.0
Name: Maths, dtype: float64